// 引用資料類別
import { Storeinfo } from './storeinfo';
export const storelist = [
  { id: '1',
    name: '7-ELEVEn 久昌門市',
    lat: 22.710613777932654,
    lng: 120.28392497931446
  },
  { id: '2',
    name: '7-ELEVEN 元昌門市',
    lat: 22.72129445061674,
    lng: 120.28973897567418
  },
  { id: '3',
    name: '7-ELEVEN 太子城門市',
    lat: 22.733862639131726,
    lng: 120.32721357714156
  },
  { id: '4',
    name: '7-ELEVEN 日明門市',
    lat: 22.713285649947444,
    lng: 120.3005437433464
  },
  { id: '5',
    name: '7-ELEVEN 日星門市',
    lat: 22.72810630681276,
    lng: 120.30968011027426
  },
  { id: '6',
    name: '7-ELEVEN 加群門市',
    lat: 22.718455531572157,
    lng: 120.29704481265938
  },
  { id: '7',
    name: '7-ELEVEn 四季春門市',
    lat: 22.72296825503893,
    lng: 120.33192994584137
  },
  { id: '8',
    name: '7-ELEVEN 好事登門市',
    lat: 22.725747707724178,
    lng: 120.32933995863812
  },
  { id: '9',
    name: '7-ELEVEn 安合門市',
    lat: 22.730136401263337,
    lng: 120.29220548197262
  },
  { id: '10',
    name: '7-ELEVEN 秀昌門市',
    lat: 22.712456194334056,
    lng: 120.29484102800278
  },
  { id: '11',
    name: '7-ELEVEn 亞新門市',
    lat: 22.716919402194808,
    lng: 120.29795931265933
  },
  { id: '12',
    name: '7-11明月門市',
    lat: 22.71447182607158,
    lng: 120.30147516979719
  },
  { id: '13',
    name: '7-ELEVEN 欣清心門市',
    lat: 22.738167590216857,
    lng: 120.33219488937753
  },
  { id: '14',
    name: '7-ELEVEN 金富門市',
    lat: 22.725199495909397,
    lng: 120.31850088752604
  },
  { id: '15',
    name: '7-ELEVEn 勁援門市',
    lat: 22.7231101795227,
    lng: 120.28212592866157
  },
  { id: '16',
    name: '7-ELEVEn 建楠門市',
    lat: 22.726921258038463,
    lng: 120.32685993481242
  },
  { id: '17',
    name: '7-ELEVEn 晉學門市',
    lat: 22.732140874961903,
    lng: 120.27652767599912
  },
  { id: '18',
    name: '7-ELEVEn 晉興門市',
    lat: 22.729425624021356,
    lng: 120.32354572508423
  },
  { id: '19',
    name: '7-ELEVEn 校和門市',
    lat: 22.706902835924936,
    lng: 120.29326261821275
  },
  { id: '20',
    name: '7-ELEVEn 海科大門市',
    lat: 22.72447742503586,
    lng: 120.31461459731601
  },
  { id: '21',
    name: 'Big 7 高昌門市',
    lat: 22.747143247849138,
    lng: 120.33050529570231
  },
  { id: '22',
    name: '7-ELEVEN 高第一門市 (角落生物主題聯名店)',
    lat: 22.75065869291926,
    lng: 120.3316962510053
  },
  { id: '23',
    name: '7-ELEVEn 常德門市',
    lat: 22.73678884327786,
    lng: 120.33690268567508
  },
  { id: '24',
    name: '7-ELEVEn 梓聖門市',
    lat: 22.72425628945588,
    lng: 120.31176476609497
  },
  { id: '25',
    name: '7-ELEVEN 盛田門市',
    lat: 22.72977431490315,
    lng: 120.3321130819725
  },
  { id: '26',
    name: '7-ELEVEn 盛合門市',
    lat: 22.72708711382824,
    lng: 120.29462829731594
  },
  { id: '27',
    name: '7-ELEVEn 祥嘉門市',
    lat: 22.7419106692968,
    lng: 120.33696126848042
  },
  { id: '28',
    name: '7-ELEVEN 都會門市',
    lat: 22.73085147800146,
    lng: 120.31671769307978
  },
  { id: '29',
    name: '7-ELEVEn 惠心門市',
    lat: 22.728695768503197,
    lng: 120.3217930863968
  },
  { id: '30',
    name: '7-ELEVEN 惠民門市',
    lat: 22.724558396930014,
    lng: 120.2974382819725
  },
  { id: '31',
    name: '7-ELEVEn 惠豐門市',
    lat: 22.724273425878092,
    lng: 120.29409899248354
  },
  { id: '32',
    name: '7-ELEVEn 援中門市',
    lat: 22.72575557409654,
    lng: 120.27735882933814
  },
  { id: '33',
    name: '7-ELEVEn 華泰電子門市',
    lat: 22.72369030224947,
    lng: 120.30196690472076
  },
  { id: '34',
    name: '7-ELEVEN 新加昌門市',
    lat: 22.720938173756277,
    lng: 120.3128677464524
  },
  { id: '35',
    name: '7-ELEVEN 新宏昌門市',
    lat: 22.716895533265077,
    lng: 120.28792658937716
  },
  { id: '36',
    name: '7-ELEVEn 新後昌門市 (鬼滅之刃主題商店)',
    lat: 22.71874627745335,
    lng: 120.31075665395433
  },
  { id: '37',
    name: '7-Eleven新後勁門市',
    lat: 22.71827263887294,
    lng: 120.31083840286952
  },
  { id: '38',
    name: '7-ELEVEN 新楠梓門市',
    lat: 22.726576697863273,
    lng: 120.32474769361362
  },
  { id: '39',
    name: '7-ELEVEN 楠鎮',
    lat: 22.720058415119762,
    lng: 120.30574431212541
  },
  { id: '40',
    name: '7-ELEVEn 廣昌門市',
    lat: 22.70863451657515,
    lng: 120.28694544096116
  },
  { id: '41',
    name: '7-ELEVEN 德中門市',
    lat: 22.72157990924183,
    lng: 120.28114527349979
  },
  { id: '42',
    name: '7-ELEVEN 德民門市',
    lat: 22.72751288380024,
    lng: 120.31018248382374
  },
  { id: '43',
    name: '7-ELEVEN 德祥門市',
    lat: 22.726787485060022,
    lng: 120.30549716662891
  },
  { id: '44',
    name: '7-ELEVEN 德賢門市',
    lat: 22.725845103069304,
    lng: 120.30072237773611
  },
  { id: '45',
    name: '7-ELEVEN 慶昌門市',
    lat: 22.710091414046712,
    lng: 120.29687651265917
  },
  { id: '46',
    name: '7-ELEVEn 樂民門市',
    lat: 22.721628516752098,
    lng: 120.29595891265944
  },
  { id: '47',
    name: '7-ELEVEN 歐士盟門市',
    lat: 22.71828792465244,
    lng: 120.28564174466393
  },
  { id: '48',
    name: '7-ELEVEn 學安門市',
    lat: 22.728422586498755,
    lng: 120.28176477086514
  },
  { id: '49',
    name: '7-ELEVEn 學高門市',
    lat: 22.72718399275004,
    lng: 120.27974690895712
  },
  { id: '50',
    name: '7-ELEVEn 藍田門市',
    lat: 22.726346618872586,
    lng: 120.29107558991117
  },
  { id: '51',
    name: '7-ELEVEn 藍昌門市',
    lat: 22.717266605063713,
    lng: 120.2912631851408
  },
  { id: '52',
    name: '7-ELEVEN 豐創門市',
    lat: 22.740126617393006,
    lng: 120.32446241511443
  },
  { id: '53',
    name: '7-ELEVEn 雙德門市',
    lat: 22.727200917883383,
    lng: 120.3031597856749
  },
  { id: '54',
    name: '7-ELEVEn 麗景門市',
    lat: 22.742290300404136,
    lng: 120.33849178567519
  },
  { id: '55',
    name: '7-ELEVEN 鑫建昌門市',
    lat: 22.71070643397533,
    lng: 120.29049896794595
  }
];
